src/Documents/ПланМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПланМеню</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУстанавливатьЦенуРеализацииИзПланМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьНаличиеВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПрименения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьПараметрыПодбораВЗаказе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьПризнакНаличияВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьТипЦенМестаРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосетителей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выход</Name>
							<Comment>Выход готового блюда, в граммах</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТовара</Name>
							<Comment>для связи с товарами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПланМеню/Forms/ФормаРедактированияНаличияВПродаже/module.bsl
Перем МассивСтрок Экспорт;

// Процедура обновляет информацию о наличии в продаже для массива строк
//
Процедура ОбновитьНаличиеВПродаже()

	Если НЕ ТипЗнч(МассивСтрок) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивСтрок.Количество() >= 1 Тогда
		
		ТекущаяСтрока = МассивСтрок[0];
		
		СписокКогдаВПродаже.Очистить();
		СписокНедель.Очистить();
		ИмяТЧ = Метаданные.НайтиПоТипу(ТипЗнч(ТекущаяСтрока)).Имя;
		
		// наличие в продаже
		ИнтерфейсАдмина.ЗаполнитьСписокДнейНедели(СписокКогдаВПродаже, ТекущаяСтрока.КогдаВПродаже);
		
		ФлагВремя1		= ЗначениеЗаполнено(ТекущаяСтрока.КогдаВПродажеВремя1);
		ФлагВремя2		= ЗначениеЗаполнено(ТекущаяСтрока.КогдаВПродажеВремя2);
		
		КогдаВПродажеВремя1 = ТекущаяСтрока.КогдаВПродажеВремя1;
		КогдаВПродажеВремя2 = ТекущаяСтрока.КогдаВПродажеВремя2;
		
		Если ИмяТЧ = "Товары" Тогда
			СтрокиПоНеделям = ДокументОбъект.КогдаВПродажеПоНеделям.НайтиСтроки(Новый Структура("ИдентификаторТовара", ТекущаяСтрока.ИдентификаторТовара));
			мКогдаВПродажеПоНеделям = ДокументОбъект.КогдаВПродажеПоНеделям.Выгрузить().Скопировать(СтрокиПоНеделям);
			
			ФлагНаличиеПоНеделям = мКогдаВПродажеПоНеделям.Количество() <> 0;
			
			ДатаПН = НачалоНедели(ТекущаяДата());
			Для н=1 По 10 Цикл
				Пометка = мКогдаВПродажеПоНеделям.Найти(ДатаПН, "ДатаПонедельника") <> Неопределено;
				СписокНедель.Добавить(ДатаПН, "Неделя № "+НеделяГода(ДатаПН)+", "+Формат(ДатаПН,"ДЛФ=Д")+" - "+Формат(КонецНедели(ДатаПН),"ДЛФ=Д"), Пометка);
				ДатаПН = КонецНедели(ДатаПН) + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УправлениеВидимостью()
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = МассивСтрок[0];
	ИмяТЧ = Метаданные.НайтиПоТипу(ТипЗнч(ТекущаяСтрока)).Имя;
	
	Если ИмяТЧ = "Товары" Тогда
		ЭлементыФормы.ПанельНаличиеПоНеделям.Свертка = РежимСверткиЭлементаУправления.Нет;
	Иначе
		ЭлементыФормы.ПанельНаличиеПоНеделям.Свертка = РежимСверткиЭлементаУправления.Верх;
	КонецЕсли;
	
	ЭлементыФормы.ИмяТабличнойЧасти.Заголовок = ИмяТЧ;
	Если МассивСтрок.Количество() = 1 Тогда
		ЭлементыФормы.НомерСтроки.Заголовок = ТекущаяСтрока.НомерСтроки;
		ИнформацияОТоваре = ТекущаяСтрока.Номенклатура.Наименование;
	ИначеЕсли МассивСтрок.Количество() > 1 Тогда
		ЭлементыФормы.НомерСтроки.Заголовок = "Несколько строк";
		ИнформацияОТоваре = "Несколько строк";
	КонецЕсли;
	ЭлементыФормы.Номенклатура.Заголовок = ИнформацияОТоваре;
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(КлючУникальности) = Тип("ДокументОбъект.ПланМеню") Тогда
		Предупреждение("Эта обработка предназначена для вызова из документа ""План-меню""");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.СписокНедель.Доступность = ФлагНаличиеПоНеделям;
	ЭлементыФормы.КогдаВПродажеВремя1.Доступность = ФлагВремя1;
	ЭлементыФормы.КогдаВПродажеВремя2.Доступность = ФлагВремя2;
	
КонецПроцедуры

// Обработчик события ОбработкаОповещения формы.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АктивизацияСтрокиТабличнойЧастиДокументаПланМеню" И ДокументОбъект = Источник Тогда
		
		//МассивСтрок = Новый Массив;
		//МассивСтрок.Добавить(Параметр);
		МассивСтрок = Параметр;
		УправлениеВидимостью();
		ОбновитьНаличиеВПродаже();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КогдаВПродажеВремя1НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ИнтерфейсАдмина.ВыбратьВремяИзСписка(ЭтаФорма, Элемент);
	СохранитьИзменения();
	
КонецПроцедуры

Процедура КоманднаяПанельКогдаВПродажеУстановитьФлажки(Кнопка)
	
	СписокКогдаВПродаже.ЗаполнитьПометки(Истина);
	СохранитьИзменения();
	
КонецПроцедуры

Процедура КоманднаяПанельКогдаВПродажеСнятьФлажки(Кнопка)
	
	СписокКогдаВПродаже.ЗаполнитьПометки(Ложь);
	СохранитьИзменения();
	
КонецПроцедуры

Процедура СохранитьИзменения()
	
	Для каждого ТекущаяСтрока Из МассивСтрок Цикл
		// наличие в продаже
		ТекущаяСтрока.КогдаВПродаже			= ИнтерфейсАдмина.СписокПометокВЧисло(СписокКогдаВПродаже);
		ТекущаяСтрока.КогдаВПродажеВремя1	= ?(ФлагВремя1, КогдаВПродажеВремя1, Неопределено);
		ТекущаяСтрока.КогдаВПродажеВремя2	= ?(ФлагВремя2, КогдаВПродажеВремя2, Неопределено);
		
		СтрокиПоНеделям = ДокументОбъект.КогдаВПродажеПоНеделям.НайтиСтроки(Новый Структура("ИдентификаторТовара", ТекущаяСтрока.ИдентификаторТовара));
		Для каждого СтрокаКУдалению Из СтрокиПоНеделям Цикл
			ДокументОбъект.КогдаВПродажеПоНеделям.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		Если ФлагНаличиеПоНеделям Тогда
			Для каждого Неделя Из СписокНедель Цикл
				Если Неделя.Пометка Тогда
					НоваяСтрока = ДокументОбъект.КогдаВПродажеПоНеделям.Добавить();
					НоваяСтрока.ДатаПонедельника	= Неделя.Значение;
					НоваяСтрока.ИдентификаторТовара	= ТекущаяСтрока.ИдентификаторТовара;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура СписокКогдаВПродажеПриИзмененииФлажка(Элемент)
	
	СохранитьИзменения();
	
КонецПроцедуры

Процедура ФлагНаличиеПоНеделямПриИзменении(Элемент)
	
	СохранитьИзменения();
	мФлагНаличиеПоНеделям = ФлагНаличиеПоНеделям;
	ОбновитьНаличиеВПродаже();
	ФлагНаличиеПоНеделям = мФлагНаличиеПоНеделям;
	
КонецПроцедуры


Процедура СписокНедельПриИзмененииФлажка(Элемент)
	
	СохранитьИзменения();
	
КонецПроцедуры
